# .---  -..  ..-
# --  .  -.-
# -.-  -..  ..-.
# .--.  ..-  ..-.
# .--.  -  -.-
# .---  .  ..-. 
# .-..  ..-
# --.  .  ..-  -.- 
# -.-.  ....  -.- 
# -.-  ..-  .--
# ..-.  ..-
# -...  .
# 희 망 망 은 진 정 한 기 생 충 입 니 다
stringa = "JDU MEK KDF PUF PTK JEF LU GEUK CHK KUW FU BE"

dict_skat = {"L" :	"ㄱ" , "E" :	"ㅏ",
"F" :	"ㄴ" , "I" :	"ㅑ",
"B" :	"ㄷ" , "T" :	"ㅓ",
"V" :	"ㄹ" , "S" :	"ㅕ",
"M" :	"ㅁ" , "A" :	"ㅗ",
"W" :	"ㅂ" , "N" :	"ㅛ",
"G" :	"ㅅ" , "H" :	"ㅜ",
"K" :	"ㅇ" , "R" :	"ㅠ",
"P" :	"ㅈ" , "D" :	"ㅡ",
"C" :	"ㅊ" , "U" :	"ㅣ",
"X" : "ㅋ" ,	"TU" :	"ㅔ",
"Z" : "ㅌ" ,	"EU" :	"ㅐ",
"O" : "ㅍ" ,	"SU" :	"ㅖ",
"J" : "ㅎ" ,	"IU" :	"ㅒ"}
trad = "ㅎㅡㅣ  ㅁㅏㅇ  ㅇㅡㄴ  ㅈㅣㄴ  ㅈㅓㅇ  ㅎㅏㄴ  ㄱㅣ  ㅅㅐㅇ  ㅊㅜㅇ  ㅇㅣㅂ  ㄴㅣ  ㄷㅏ"

for i in stringa:
	try:
		print(dict_skat[i], end = '')
	except:
		print(" ", end = ' ')

print("")